cf_billing/Documents/энргУстановитьЗначенияТарифовДиапазоновДифференцированногоТарифа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьЗначенияТарифовДиапазоновДифференцированногоТарифа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргЗначенияТарифовДиапазоновДифференцированногоТарифа</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Разрезы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаПотребителей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияТарифов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Диапазон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДиапазоныДифференцированныхТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСВнутри</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргУстановитьЗначенияТарифовДиапазоновДифференцированногоТарифа/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодключаемыеКомандыПриСозданииНаСервере();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.Организация = Справочники.Организации.НашаОрганизация;
		КонецЕсли;
		
		ОсновныеРеквизиты = Новый Структура;
		ОсновныеРеквизиты.Вставить("Дата", Объект.Дата);
		ОсновныеРеквизиты.Вставить("Организация", Объект.Организация);
		ОсновныеРеквизиты.Вставить("Район", Объект.Район);
		
		Объект.Дата = ОпределитьПериодНачисления(ОсновныеРеквизиты);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОсновныеРеквизиты = ОсновныеРеквизиты();
	Объект.Дата = ОпределитьПериодНачисления(ОсновныеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОсновныеРеквизиты = ОсновныеРеквизиты();
	Объект.Дата = ОпределитьПериодНачисления(ОсновныеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	
	ОсновныеРеквизиты = ОсновныеРеквизиты();
	Объект.Дата = ОпределитьПериодНачисления(ОсновныеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРазрезы

&НаКлиенте
Процедура РазрезыПриАктивизацииСтроки(Элемент)

	УстановитьОтборСвязанныхТаблиц();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрезыПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.Разрезы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("ИдентификаторСтроки", ТекДанные.ИдентификаторСтроки);
	Коллекция = Объект.ЗначенияТарифов;
	Строки = Коллекция.НайтиСтроки(СтруктураПоиска);	
	Для Каждого УдаляемаяСтрока из Строки Цикл 			
		Коллекция.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрезыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		УстановитьОтборСвязанныхТаблиц();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСвязанныхТаблиц()
	
	ТекущиеДанные = Элементы.Разрезы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(
	Элементы.ЗначенияТарифов, 
	"ИдентификаторСтроки", 
	ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗначенияТарифов

&НаКлиенте
Процедура ЗначенияТарифовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекДанные = Элементы.Разрезы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияТарифовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанные = Элементы.Разрезы.ТекущиеДанные;
		Элемент.ТекущиеДанные.ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПредзаполнитьДиапазоны(Команда)
	
	ТекДанные = Элементы.Разрезы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru = 'Необходимо выбрать разрез диапазона перед заполнением диапазонов'"));
		
		Возврат;
		
	КонецЕсли;                         
	
	ПредзаполнитьДиапазоныНаСервере(ТекДанные.ИдентификаторСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ОсновныеРеквизиты() 
	
	Результат = Новый Структура;
	Результат.Вставить("Дата", Объект.Дата);
	Результат.Вставить("Организация", Объект.Организация);
	Результат.Вставить("Район", Объект.Район);
	
	Возврат Результат;
	
КонецФункции

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервереБезКонтекста
Функция ОпределитьПериодНачисления(ОсновныеРеквизиты)
	
	ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(
	ОсновныеРеквизиты.Дата,
	ОсновныеРеквизиты.Организация,
	ОсновныеРеквизиты.Район);
	
	Возврат ПериодНачисления;
	
КонецФункции

#КонецОбласти

#Область СобытияТаблицыЗначенияТарифов

&НаСервере
Процедура ПредзаполнитьДиапазоныНаСервере(ИдентификаторСтроки)

	энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(
	Объект.ЗначенияТарифов,
	Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
		
	РезультатЗапроса = Справочники.энргДиапазоныДифференцированныхТарифов.Дипазоны();	
	Выборка	= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НСтрока = Объект.ЗначенияТарифов.Добавить();
		НСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
		НСтрока.Диапазон = Выборка.Диапазон;
		
	КонецЦикла;  
	
КонецПроцедуры
	
#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура ПодключаемыеКомандыПриСозданииНаСервере()
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти   

#КонецОбласти
